# SpaceTagType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceTag..::..SpaceTagType Property
SpaceTag Class See Also
---
The tag type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceTagType SpaceTagType { get; set; }
```

Visual Basic
---
```text
Public Property SpaceTagType As SpaceTagType
	Get
	Set
```

Visual C++
---
```text
public:
property SpaceTagType^ SpaceTagType {
	SpaceTagType^ get ();
	void set (SpaceTagType^ value);
}
```

# See Also
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace